{
  "main": {
    "name":"Joonsoo (Daniel) Kim",
    "occupation":"University Student/Full Stack Developer",
    "description":"I'm pursuing my path in both Software and Hardware Engineer",
    "image":"profilepic.jpg",
    "bio":"Use this bio section as your way of describing yourself and saying what you do, what technologies you like to use or feel most comfortable with, describing your personality, or whatever else you feel like throwing in.",
    "contactmessage":"Please fill in the form below to contact me for any questions.",
    "email": "16jk1@queensu.ca",
    "phone": "343-363-8249",
    "address":{
      "street":"",
      "city":"Toronto",
      "state":"Ontario",
      "zip": ""
    },
    "website": "https://16jk1.github.io/personal_website/",
    "resumedownload":"10-15-2021 Resume.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/joonsoo-kim-112b66152/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"http://github.com/16jk1",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "education":[
      {
        "school":"Queen's University",
        "degree":"Computer Engineering with Professional Engineering experience",
        "graduated":"Present",
        "description":"Took courses in Algorithms, Data Structures, Computer Architecture, Microprocessor Systems, Operating Systems, Digital Systems Engineering, Object Oriented Programming, and Human-Computer Interaction"
      }
    ],
    "work":[
      {
        "company":"Askuity at The Home Depot",
        "title":"Backend Developer",
        "years":"November 2021 - Present",
        "description":""
      },
      {
        "company":"Checkmate",
        "title":"Full Stack Developer",
        "years":"October 2020 - April 2021",
        "description":"Assigned as a lead web developer of prototyping a global stock exchange information service application using ReactJS, GraphQL, Prisma, Apollo, React Native, and Heroku. Developed functionalities such as authentication, like/unlike a photo, comment, search by user, search by location, see user profile, follow/unfollow user, and show the feed. Integrated web service into iOS and Android application using Expo and React Native."
      },
      {
        "company":"Ontario Power Generation",
        "title":"Computers and Control Design Engineer",
        "years":"May 2019 - May 2020",
        "description":"Investigated and analyzed critical errors on the Shut Down System by programming C++ and Shell scripts to replicate errors occurred at the plant site. Reduced 6 months investigation period to 2 weeks by use of scripts. Constructed and redesigned the hardware configuration of the Validation Test Rigs computer to emulate and monitor field within 4 months period. The VTR hosts software which is used to create and verify different field scenarios through use of the VTR hardware. Created a software application that replicates the field data and sends it to computers in the lab for testing purposes using LabView, C#, and .NET. "
      },
      {
        "company":"Diversability Development Oraganization",
        "title":"Web Developer",
        "years":"June 2018 - Auguest 2018",
        "description":"Designed a website using software programs such as HTML, CSS, JavaScript, WordPress, PHP, and Python to ensure website compliance with accessibility standards. Optimized the server traffic, ecommerce, image sizes, and email transfer to make the overall loading time 10% faster."
      }
    ],
    "skills":[
      {
        "name":"Java, C++, Python, C, C#",
        "level":"85%"
      },
      {
        "name":"ReactJS, Apollo, React Native",
        "level":"80%"
      },
      {
        "name":"GraphQL, Prisma",
        "level":"70%"
      },
      {
        "name":"TypeScript, NodeJS",
        "level":"60%"
      },
      {
        "name":"MongoDB, Mongoose, Express",
        "level":"50%"
      },
      {
        "name":"PHP, MySQL",
        "level":"100%"
      },
      {
        "name":"Linux",
        "level":"50%"
      },
      {
        "name":"Android Studio, Unity",
        "level":"60%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"BlueChip",
        "category":"I worked at a startup company to build a prototype for their SNS application. I used ReactJS, Apollo, Prisma, GraphQL, and React Native ",
        "image":"bluechip.jpg",
        "url":"https://bluechip-checkmate.netlify.app/"
      },
      {
        "title":"Diversability Development Organization",
        "category":"I worked at this company as a Web Developer to compliance their website with accessiblity standard. I used HTML, CSS, JavaScript, WordPress, PHP, and Python to beautify the website.",
        "image":"ddo.jpg",
        "url":"https://diversable.org/"
      },
      {
        "title":"Movie Rating App",
        "category":"I am fairly new to React and really liking it. I am continuing to use React to develop cool projects. I have built a ReactJS based Web App that lists movies upon their popularity and rankings.",
        "image":"move-app.jpg",
        "url":"https://16jk1.github.io/movie-app/"
      },
      {
        "title":"Bom Bibimbap",
        "category":"Bom Bibimbap is a fairly popular restaurant that is located in the greater Toronto area. I mainly used Boostrap to create an advertisement website for their restaurant such that their customers can easily access information about the restaurant.",
        "image":"bom.jpg",
        "url":"https://www.bombibimbap.com"
      },
      {
        "title":"Heartbeat Sensor VR Game",
        "category":"I created an exercise game in Unity for the Google Daydream VR headset utilizing a heart rate monitor and an Arduino Uno. I took a big contribution in this project by using assembly code in Arduino read the analog and digital signals from the heartbeat sensors to Unity.",
        "image":"vrgame.jpg",
        "url":"https://www.youtube.com/watch?v=Bu0UY1nOdLY"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user":"Kareem Abdul Jabbar"
      },
      {
        "text":"That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user":"Steve Wozniak... impersonator"
      }
    ]
  }
}
